# Duct Fitting And Accessory Pressure Drop Item Properties

Source: https://www.revitapidocs.com/2026/1b6ce1c9-600c-8027-a6a6-bde8a7d0782d.htm

---

| Duct Fitting And Accessory Pressure Drop Item Properties |
| --- |

The DuctFittingAndAccessoryPressureDropItem type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | BeginConnectorIndex | The index of the begin connector of the flow path. |
|  | Coefficient | The coefficient between the begin connector and end connector, unitless. |
|  | EndConnectorIndex | The index of the end conector of the flow path. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | VelocityPressure | The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)). |

Top See Also

#### Reference

DuctFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Mechanical Namespace